app/views/communities/partial/_event.html.erb

SELECT "events".* FROM "events" WHERE "events"."community_id" = ?  [["community_id", 1]]
---
	<div class="wrapper_wide clearfix">
		<% @community.events.each do |event| %>