app/views/communities/partial/_neighborhood.html.erb

<div class="clearfix">
	<% @community.neighborhoods.each do |f| %>
---
SELECT "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."community_id" = ?  [["community_id", 1]]