app/controllers/communities_controller.rb

INSERT INTO "communities" ("name", "location", "banner_image_file_name", "banner_image_content_type", "banner_image_file_size", "banner_image_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@community = Community.new(community_params)
		if @community.save

UPDATE "communities" SET "thumbnail_image_file_name" = ?, "thumbnail_image_content_type" = ?, "thumbnail_image_file_size" = ?, "thumbnail_image_updated_at" = ?, "updated_at" = ? WHERE "communities"."id" = ?
---
	def update
		if @community.update(community_params)

SELECT  "communities".* FROM "communities" WHERE "communities"."id" = ? LIMIT 1  [["id", 1]]
---
	def find_community
		@community = Community.find(params[:id])