app/controllers/events_controller.rb

	def create
		@event = Event.new(event_params)
		@event.community_id = @community.id
		if @event.save
---
INSERT INTO "events" ("title", "description", "date", "neighborhood_id", "community_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

	def update
		if @event.update(event_params)
---
UPDATE "events" SET "title" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["title", "Event 2.5"], ["updated_at", "2016-04-28 20:52:37.353928"], ["id", 2]]

	def set_community
		@community = Community.find(params[:community_id])
---
SELECT  "communities".* FROM "communities" WHERE "communities"."id" = ? LIMIT 1  [["id", nil]]

	def find_event
		@event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 2]]