app/controllers/neighborhoods_controller.rb

INSERT INTO "neighborhoods" ("name", "community_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Gilman"], ["community_id", 1], ["created_at", "2016-04-28 19:08:40.536911"], ["updated_at", "2016-04-28 19:08:40.536911"]]
---
	def create
		@neighborhood = Neighborhood.new(neighborhood_params)
		@neighborhood.community_id = @community.id

		if @neighborhood.save

UPDATE "neighborhoods" SET "profile_picture_file_name" = ?, "profile_picture_content_type" = ?, "profile_picture_file_size" = ?, "profile_picture_updated_at" = ?, "updated_at" = ? WHERE "neighborhoods"."id" = ?
---
	def update
		if @neighborhood.update(neighborhood_params)

SELECT  "communities".* FROM "communities" WHERE "communities"."id" = ? LIMIT 1  [["id", 4]]
---
	def set_community
		@community = Community.find(params[:community_id])

SELECT  "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."id" = ? LIMIT 1  [["id", 4]]
---
	def find_neighborhood
		@neighborhood = Neighborhood.find(params[:id])