app/controllers/pages_controller.rb

SELECT  "communities".* FROM "communities"  ORDER BY RANDOM() LIMIT 3
---
	def index
		@communities = Community.all.limit(3).order("RANDOM()")